%%矩阵定义

A1 = [1 2 3;4 5 6;7 8 9];

A2 = 1:3:9;% 起始+步长+最大   1 4 7

A3 = 1:9;%步长为1

A4 = repmat(A2,3,2);%竖直 横向 重复    1 4 7 1 4 7
                    %                 1 4 7 1 4 7
                    %                 1 4 7 1 4 7

A5 = ones(3,6);%全为1的矩阵


%%矩阵计算

inv(A);%求逆

C0 = A';%转置

C1 = A + B;

C2 = A - B;

C3 = A * B;

C4 = A .* B;%对应项相乘

C5 = A / B;%乘B的逆

C6 = A ./ B;%对应项相除


%%矩阵下标

D0 = A(2,3);

D1 = A(2,:);%第二行

D2 = A(:,4);%第四列

[m,n] = find(A > 20);%矩阵A中大于20的元素的索引值，输出m和n分别为列向量



%%元胞数组    重要事情说三遍：元胞索引用的是{}   元胞索引用的是{}   元胞索引用的是{}
A = cell(3,5);

A{1,3} = eye(3);

A{2,2} = magic(5);

A{1,1} = 7;

B = A{2,2};




%%结构体
book = struct('name',"math",'price',[30,40]);

book.name;